#include<stdio.h>
#include<winsock2.h>
#include<iostream>
#include<queue>
#include<vector>
#include"CommenUtil.h"

using namespace std;

#pragma comment(lib,"ws2_32.lib")	//编译指示

#define MSGSIZE 1024

//请求结构体(请求队列中的单位元)
typedef struct RequstNode
{
	//提取到的第一个参数，255字节的函数全名称
	char funcName[255];
	//提取到的第二个参数，要调用的函数的参数的数目
	int paraNum;
	//提取到的第三个参数，要调用的函数的参数值及属性
	vector<sPara> vecPara;
	//发起请求的客户端套接字
	SOCKET socClient;

}SRequstNode;

//结果结构体(结果队列中的单位元)
typedef struct ResultNode
{
	//服务器返回的数据
	sPara sReturnData;
	//发起请求的客户端套接字
	SOCKET socClient;

}SResultNode;



//通用队列类
class CQueue
{
public:
	//------------------------------------------------------------------------------------------------
	//功能：
	//	类的构造函数，初始化该请求结果队列所在服务器的套接字
	//------------------------------------------------------------------------------------------------
	CQueue();

	//------------------------------------------------------------------------------------------------
	//功能：对strReqBuf的内容进行解析，并加入任务队列
	//参数：[in] clientsoc - 客户端套接字
	//-------------------------------------------------------------------------------------------------------
	void Push(SOCKET clientsoc);

	//------------------------------------------------------------------------------------------------
	//功能：从请求队列队首取出任务，执行相关操作，将处理结果放入结果队列
	//------------------------------------------------------------------------------------------------
	void RunTask();

	//------------------------------------------------
	//功能：将结果队列队首的结果信息打成信息包,发送给客户端
	//------------------------------------------------
	void Pop();

private:
	//队列
	queue<SRequstNode> m_queue;
};