#include<stdio.h>
#include<winsock2.h>
#include<iostream>
#include<queue>
#include<vector>
#include"CommenUtil.h"

using namespace std;

#pragma comment(lib,"ws2_32.lib")	//编译指示

#define MSGSIZE 1024

//请求结构体(请求队列中的单位元)
typedef struct Requst
{
	//提取到的第一个参数，255字节的函数全名称
	char funcName[255];
	//提取到的第二个参数，要调用的函数的参数的数目
	int paraNum;
	//提取到的第三个参数，要调用的函数的参数值及属性
	vector<sPara> vecPara;
	//发起请求的客户端套接字
	SOCKET socClient;

}SRequst;

//结果结构体(结果队列中的单位元)
typedef struct Result
{
	//服务器返回的数据
	sPara sReturnData;
	//发起请求的客户端套接字
	SOCKET socClient;

}SResult;



//把请求队列和结果队列封装到一个类中
//类中提供对请求队列和结果队列进行各种操作的方法
class CReqRes
{
public:
	//------------------------------------------------------------------------------------------------
	//功能：
	//	类的构造函数，初始化该请求结果队列所在服务器的套接字
	//------------------------------------------------------------------------------------------------
	CReqRes(SOCKET m_serversoc);



//===========================================================================================================
//下面这两个被注掉的函数所围绕的ClientSoc队列，已经作为server的全局变量被操作了

	//------------------------------------------------------------------------------------------------
	//功能：将accept到的发来请求的客户端套接字加入客户套接字队列
	//参数：[in] clientsoc -- 要被加入的客户端套接字
	//返回值：void
	//------------------------------------------------------------------------------------------------
//	void PushClientSoc(SOCKET clientsoc);


	//------------------------------------------------------------------------------------------------
	//功能：从客户套接字队列中获取一个套接字
	//参数：[out] clientsoc -- 要被取出的客户端套接字
	//返回值：void
	//------------------------------------------------------------------------------------------------
//	void PopClientSoc(SOCKET & clientsoc);
//============================================================================================================



	//------------------------------------------------------------------------------------------------
	//功能：对strReqBuf的内容进行解析，并加入任务队列
	//参数：[in] clientsoc - 客户端套接字
	//-------------------------------------------------------------------------------------------------------
	void PushTask(SOCKET clientsoc);

	//------------------------------------------------------------------------------------------------
	//功能：从请求队列队首取出任务，执行相关操作，将处理结果放入结果队列
	//------------------------------------------------------------------------------------------------
	void RunTask();

	//------------------------------------------------
	//功能：将结果队列队首的结果信息打成信息包,发送给客户端
	//------------------------------------------------
	void PopTask();

	//select模式下的多线程
	static DWORD WINAPI WorkerThread(LPVOID lpParam);


public:
	//ClientSocArr
	static int    g_iTotalConn;			//静态成员需要在外部声明！！！
	static SOCKET g_CliSocketArr[256];	//静态成员需要在外部声明！！！


private:
	//本类队列所在服务器端的套接字
	SOCKET m_serversoc;

	//请求队列
	queue<SRequst> m_qRequest;
	//结果队列
	queue<SResult> m_qResult;
};